In [36]:
import numpy as np

In [37]:
import pandas as pd

In [38]:
#help(pd.Series)

In [39]:
myindex = ['USA','Canada','Mexico']

In [40]:
mydata = [1776,1867,1821]

In [41]:
myser = pd.Series(data = mydata,index = myindex)

In [42]:
myser

USA       1776
Canada    1867
Mexico    1821
dtype: int64

In [43]:
myser[0]

1776

In [44]:
myser['USA']

1776

In [45]:
#create Series by Dictionary

In [46]:
ages = {'sam':5,'frank':10,'spike':7}

In [47]:
pd.Series(ages)

sam       5
frank    10
spike     7
dtype: int64

In [48]:
q1 = {'Japan': 80, 'China': 450, 'India': 200, 'USA': 250}
q2 = {'Brazil': 100,'China': 500, 'India': 210,'USA': 260}

In [49]:
sales_q1 = pd.Series(q1)
sales_q2 = pd.Series(q2)

In [50]:
sales_q1 [0]

80

In [51]:
sales_q1 ['Japan']

80

In [52]:
sales_q1 * 2

Japan    160
China    900
India    400
USA      500
dtype: int64

In [53]:
sales_q1 / 100

Japan    0.8
China    4.5
India    2.0
USA      2.5
dtype: float64

In [54]:
sales_q1 + sales_q2

Brazil      NaN
China     950.0
India     410.0
Japan       NaN
USA       510.0
dtype: float64

In [55]:
sales_q1.add(sales_q2,fill_value=0)

Brazil    100.0
China     950.0
India     410.0
Japan      80.0
USA       510.0
dtype: float64

In [3]:
import pandas as pd

In [86]:
d = {"Apple":45,"Mango":78,"Grapes":47,"Banana":58,"Kiwi":96,"df":None}

In [87]:
df1 = pd.Series(d)

In [88]:
df1

Apple     45.0
Mango     78.0
Grapes    47.0
Banana    58.0
Kiwi      96.0
df         NaN
dtype: float64

In [89]:
Col = ["Price"]

In [90]:
dff= pd.DataFrame(data=df1,columns=Col)

In [91]:
dff["Fruits"]=dff.index

In [92]:
dff

        Price  Fruits
Apple    45.0   Apple
Mango    78.0   Mango
Grapes   47.0  Grapes
Banana   58.0  Banana
Kiwi     96.0    Kiwi
df        NaN      df

In [93]:
dff

        Price  Fruits
Apple    45.0   Apple
Mango    78.0   Mango
Grapes   47.0  Grapes
Banana   58.0  Banana
Kiwi     96.0    Kiwi
df        NaN      df

In [94]:
dff = dff.reset_index()

In [95]:
dff

    index  Price  Fruits
0   Apple   45.0   Apple
1   Mango   78.0   Mango
2  Grapes   47.0  Grapes
3  Banana   58.0  Banana
4    Kiwi   96.0    Kiwi
5      df    NaN      df

In [97]:
dff = dff.drop(columns="index")